tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/core"
#tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "universal-ctags/universal-ctags"
brew "jpeg-xl"
brew "aom"
brew "argocd"
brew "aws-nuke"
brew "awscli"
brew "bash"
brew "bat"
brew "glib"
brew "cmake"
brew "conan"
brew "exa"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-delta"
brew "universal-ctags"
brew "global"
brew "glow"
brew "gobject-introspection"
brew "google-java-format"
brew "librsvg"
brew "graphviz"
brew "guile"
brew "helm"
brew "iperf3"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "lazygit"
brew "llvm"
brew "maven"
brew "mercurial"
brew "minikube"
brew "neovim"
brew "nghttp2"
brew "node"
brew "openjdk@11"
brew "python@3.9"
brew "qemu"
brew "ranger"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "stow"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zsh"
brew "derailed/k9s/k9s"
cask "alacritty"
cask "emacs"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "kawa"
cask "mos"
cask "openlens"
cask "postman"
cask "vagrant"
cask "zap"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hoovercj.vscode-settings-cycler"
vscode "James-Yu.latex-workshop"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "LeetCode.vscode-leetcode"
vscode "marquesmps.dockerfile-validator"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "redhat.java"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
